export const tmp = '';

//! API
// : 애플리케이션 프로그래밍 인터페이스
// : 다른 소프트웨어 시스템과 통신을 하기 위한 규칙

// 웹 API
// : HTTP 프로토콜을 사용하여 웹 서버와 클라이언트 간에 통신을 가능하게 함
// : 종류(REST API, GraphQL API)

// REST 구성
// 자원 - URL
// 행위 - HTTP METHOD
// 표현

//? http method의 역할
// post: 새로운 데이터를 생성(리소스 생성)
//      데이터는 요청의 본문(Body)에 포함되어 전송

// get: 기존 데이터를 검색(리소스 조회)
//      요청 데이터는 URI에 포함되어 전달

// put: 기존 데이터를 수정(리소스 수정)
//  변경할 데이터는 요청 본문(Body)에 포함되어 전송

// delete: 기존 데이터 삭제(리소스 삭제)
//      삭제할 데이터는 URI에 지정되어 전달

// URI는 통합 자원 식별자
// : URL에 프로토콜이 포함된 형식

//? HTTP 응답 상태 코드
// 200(201): 클라이언트의 요청을 정상적으로 수행

// 400: 클라이언트의 요청이 부적절
// 401: 인증되지 않은 상태에서 리소스 요청
// 403: 인증상태와 상관 없이 응답하고 싶지 X
// 404: 클라이언트가 존재하지 않는 URL을 탐색
// 405: 사용 불가능한 Method 사용 시

// 304: 요청된 리소스를 재전송할 필요가 없음
// 500: 서버 오류